openwsn-berkeley/openwsn-fw/bsp/boards/nrf52840dk/sdk/components/libraries/crypto/nrf_crypto_ecc.c
#define BACKEND_IMPL_GET(table, curve_type) (table)[(uint32_t)(curve_type)]


#else


#if NRF_CRYPTO_ECC_SECP160R1_ENABLED
#define key_pair_generate_impl    nrf_crypto_backend_secp160r1_key_pair_generate
#define public_key_calculate_impl nrf_crypto_backend_secp160r1_public_key_calculate
#define private_key_from_raw_impl nrf_crypto_backend_secp160r1_private_key_from_raw
#define private_key_to_raw_impl   nrf_crypto_backend_secp160r1_private_key_to_raw
#define public_key_from_raw_impl  nrf_crypto_backend_secp160r1_public_key_from_raw
#define public_key_to_raw_impl    nrf_crypto_backend_secp160r1_public_key_to_raw
#define private_key_free_impl     nrf_crypto_backend_secp160r1_private_key_free
#define public_key_free_impl      nrf_crypto_backend_secp160r1_public_key_free
#define key_pair_generate_context_size \
    NRF_CRYPTO_BACKEND_SECP160R1_KEY_PAIR_GENERATE_CONTEXT_SIZE
#define public_key_calculate_context_size \
    NRF_CRYPTO_BACKEND_SECP160R1_PUBLIC_KEY_CALCULATE_CONTEXT_SIZE
#elif NRF_CRYPTO_ECC_SECP160R2_ENABLED
#define key_pair_generate_impl    nrf_crypto_backend_secp160r2_key_pair_generate
#define public_key_calculate_impl nrf_crypto_backend_secp160r2_public_key_calculate
#define private_key_from_raw_impl nrf_crypto_backend_secp160r2_private_key_from_raw
#define private_key_to_raw_impl   nrf_crypto_backend_secp160r2_private_key_to_raw
#define public_key_from_raw_impl  nrf_crypto_backend_secp160r2_public_key_from_raw
#define public_key_to_raw_impl    nrf_crypto_backend_secp160r2_public_key_to_raw
#define private_key_free_impl     nrf_crypto_backend_secp160r2_private_key_free
#define public_key_free_impl      nrf_crypto_backend_secp160r2_public_key_free
#define key_pair_generate_context_size \
    NRF_CRYPTO_BACKEND_SECP160R2_KEY_PAIR_GENERATE_CONTEXT_SIZE
#define public_key_calculate_context_size \
    NRF_CRYPTO_BACKEND_SECP160R2_PUBLIC_KEY_CALCULATE_CONTEXT_SIZE
#elif NRF_CRYPTO_ECC_SECP192R1_ENABLED
#define key_pair_generate_impl    nrf_crypto_backend_secp192r1_key_pair_generate
#define public_key_calculate_impl nrf_crypto_backend_secp192r1_public_key_calculate
#define private_key_from_raw_impl nrf_crypto_backend_secp192r1_private_key_from_raw
#define private_key_to_raw_impl   nrf_crypto_backend_secp192r1_private_key_to_raw
#define public_key_from_raw_impl  nrf_crypto_backend_secp192r1_public_key_from_raw
#define public_key_to_raw_impl    nrf_crypto_backend_secp192r1_public_key_to_raw
#define private_key_free_impl     nrf_crypto_backend_secp192r1_private_key_free
#define public_key_free_impl      nrf_crypto_backend_secp192r1_public_key_free
#define key_pair_generate_context_size \
    NRF_CRYPTO_BACKEND_SECP192R1_KEY_PAIR_GENERATE_CONTEXT_SIZE
#define public_key_calculate_context_size \
    NRF_CRYPTO_BACKEND_SECP192R1_PUBLIC_KEY_CALCULATE_CONTEXT_SIZE
#elif NRF_CRYPTO_ECC_SECP224R1_ENABLED
#define key_pair_generate_impl    nrf_crypto_backend_secp224r1_key_pair_generate
#define public_key_calculate_impl nrf_crypto_backend_secp224r1_public_key_calculate
#define private_key_from_raw_impl nrf_crypto_backend_secp224r1_private_key_from_raw
#define private_key_to_raw_impl   nrf_crypto_backend_secp224r1_private_key_to_raw
#define public_key_from_raw_impl  nrf_crypto_backend_secp224r1_public_key_from_raw
#define public_key_to_raw_impl    nrf_crypto_backend_secp224r1_public_key_to_raw
#define private_key_free_impl     nrf_crypto_backend_secp224r1_private_key_free
#define public_key_free_impl      nrf_crypto_backend_secp224r1_public_key_free
#define key_pair_generate_context_size \
    NRF_CRYPTO_BACKEND_SECP224R1_KEY_PAIR_GENERATE_CONTEXT_SIZE
#define public_key_calculate_context_size \
    NRF_CRYPTO_BACKEND_SECP224R1_PUBLIC_KEY_CALCULATE_CONTEXT_SIZE
#elif NRF_CRYPTO_ECC_SECP256R1_ENABLED
#define key_pair_generate_impl    nrf_crypto_backend_secp256r1_key_pair_generate
#define public_key_calculate_impl nrf_crypto_backend_secp256r1_public_key_calculate
#define private_key_from_raw_impl nrf_crypto_backend_secp256r1_private_key_from_raw
#define private_key_to_raw_impl   nrf_crypto_backend_secp256r1_private_key_to_raw
#define public_key_from_raw_impl  nrf_crypto_backend_secp256r1_public_key_from_raw
#define public_key_to_raw_impl    nrf_crypto_backend_secp256r1_public_key_to_raw
#define private_key_free_impl     nrf_crypto_backend_secp256r1_private_key_free
#define public_key_free_impl      nrf_crypto_backend_secp256r1_public_key_free
#define key_pair_generate_context_size \
    NRF_CRYPTO_BACKEND_SECP256R1_KEY_PAIR_GENERATE_CONTEXT_SIZE
#define public_key_calculate_context_size \
    NRF_CRYPTO_BACKEND_SECP256R1_PUBLIC_KEY_CALCULATE_CONTEXT_SIZE
#elif NRF_CRYPTO_ECC_SECP384R1_ENABLED
#define key_pair_generate_impl    nrf_crypto_backend_secp384r1_key_pair_generate
#define public_key_calculate_impl nrf_crypto_backend_secp384r1_public_key_calculate
#define private_key_from_raw_impl nrf_crypto_backend_secp384r1_private_key_from_raw
#define private_key_to_raw_impl   nrf_crypto_backend_secp384r1_private_key_to_raw
#define public_key_from_raw_impl  nrf_crypto_backend_secp384r1_public_key_from_raw
#define public_key_to_raw_impl    nrf_crypto_backend_secp384r1_public_key_to_raw
#define private_key_free_impl     nrf_crypto_backend_secp384r1_private_key_free
#define public_key_free_impl      nrf_crypto_backend_secp384r1_public_key_free
#define key_pair_generate_context_size \
    NRF_CRYPTO_BACKEND_SECP384R1_KEY_PAIR_GENERATE_CONTEXT_SIZE
#define public_key_calculate_context_size \
    NRF_CRYPTO_BACKEND_SECP384R1_PUBLIC_KEY_CALCULATE_CONTEXT_SIZE
#elif NRF_CRYPTO_ECC_SECP521R1_ENABLED
#define key_pair_generate_impl    nrf_crypto_backend_secp521r1_key_pair_generate
#define public_key_calculate_impl nrf_crypto_backend_secp521r1_public_key_calculate
#define private_key_from_raw_impl nrf_crypto_backend_secp521r1_private_key_from_raw
#define private_key_to_raw_impl   nrf_crypto_backend_secp521r1_private_key_to_raw
#define public_key_from_raw_impl  nrf_crypto_backend_secp521r1_public_key_from_raw
#define public_key_to_raw_impl    nrf_crypto_backend_secp521r1_public_key_to_raw
#define private_key_free_impl     nrf_crypto_backend_secp521r1_private_key_free
#define public_key_free_impl      nrf_crypto_backend_secp521r1_public_key_free
#define key_pair_generate_context_size \
    NRF_CRYPTO_BACKEND_SECP521R1_KEY_PAIR_GENERATE_CONTEXT_SIZE
#define public_key_calculate_context_size \
    NRF_CRYPTO_BACKEND_SECP521R1_PUBLIC_KEY_CALCULATE_CONTEXT_SIZE
#elif NRF_CRYPTO_ECC_SECP160K1_ENABLED
#define key_pair_generate_impl    nrf_crypto_backend_secp160k1_key_pair_generate
#define public_key_calculate_impl nrf_crypto_backend_secp160k1_public_key_calculate
#define private_key_from_raw_impl nrf_crypto_backend_secp160k1_private_key_from_raw
#define private_key_to_raw_impl   nrf_crypto_backend_secp160k1_private_key_to_raw
#define public_key_from_raw_impl  nrf_crypto_backend_secp160k1_public_key_from_raw
#define public_key_to_raw_impl    nrf_crypto_backend_secp160k1_public_key_to_raw
#define private_key_free_impl     nrf_crypto_backend_secp160k1_private_key_free
#define public_key_free_impl      nrf_crypto_backend_secp160k1_public_key_free
#define key_pair_generate_context_size \
    NRF_CRYPTO_BACKEND_SECP160K1_KEY_PAIR_GENERATE_CONTEXT_SIZE
#define public_key_calculate_context_size \
    NRF_CRYPTO_BACKEND_SECP160K1_PUBLIC_KEY_CALCULATE_CONTEXT_SIZE
#elif NRF_CRYPTO_ECC_SECP192K1_ENABLED
#define key_pair_generate_impl    nrf_crypto_backend_secp192k1_key_pair_generate
#define public_key_calculate_impl nrf_crypto_backend_secp192k1_public_key_calculate
#define private_key_from_raw_impl nrf_crypto_backend_secp192k1_private_key_from_raw
#define private_key_to_raw_impl   nrf_crypto_backend_secp192k1_private_key_to_raw
#define public_key_from_raw_impl  nrf_crypto_backend_secp192k1_public_key_from_raw
#define public_key_to_raw_impl    nrf_crypto_backend_secp192k1_public_key_to_raw
#define private_key_free_impl     nrf_crypto_backend_secp192k1_private_key_free
#define public_key_free_impl      nrf_crypto_backend_secp192k1_public_key_free
#define key_pair_generate_context_size \
    NRF_CRYPTO_BACKEND_SECP192K1_KEY_PAIR_GENERATE_CONTEXT_SIZE
#define public_key_calculate_context_size \
    NRF_CRYPTO_BACKEND_SECP192K1_PUBLIC_KEY_CALCULATE_CONTEXT_SIZE
#elif NRF_CRYPTO_ECC_SECP224K1_ENABLED
#define key_pair_generate_impl    nrf_crypto_backend_secp224k1_key_pair_generate
#define public_key_calculate_impl nrf_crypto_backend_secp224k1_public_key_calculate
#define private_key_from_raw_impl nrf_crypto_backend_secp224k1_private_key_from_raw
#define private_key_to_raw_impl   nrf_crypto_backend_secp224k1_private_key_to_raw
#define public_key_from_raw_impl  nrf_crypto_backend_secp224k1_public_key_from_raw
#define public_key_to_raw_impl    nrf_crypto_backend_secp224k1_public_key_to_raw
#define private_key_free_impl     nrf_crypto_backend_secp224k1_private_key_free
#define public_key_free_impl      nrf_crypto_backend_secp224k1_public_key_free
#define key_pair_generate_context_size \
    NRF_CRYPTO_BACKEND_SECP224K1_KEY_PAIR_GENERATE_CONTEXT_SIZE
#define public_key_calculate_context_size \
    NRF_CRYPTO_BACKEND_SECP224K1_PUBLIC_KEY_CALCULATE_CONTEXT_SIZE
#elif NRF_CRYPTO_ECC_SECP256K1_ENABLED
#define key_pair_generate_impl    nrf_crypto_backend_secp256k1_key_pair_generate
#define public_key_calculate_impl nrf_crypto_backend_secp256k1_public_key_calculate
#define private_key_from_raw_impl nrf_crypto_backend_secp256k1_private_key_from_raw
#define private_key_to_raw_impl   nrf_crypto_backend_secp256k1_private_key_to_raw
#define public_key_from_raw_impl  nrf_crypto_backend_secp256k1_public_key_from_raw
#define public_key_to_raw_impl    nrf_crypto_backend_secp256k1_public_key_to_raw
#define private_key_free_impl     nrf_crypto_backend_secp256k1_private_key_free
#define public_key_free_impl      nrf_crypto_backend_secp256k1_public_key_free
#define key_pair_generate_context_size \
    NRF_CRYPTO_BACKEND_SECP256K1_KEY_PAIR_GENERATE_CONTEXT_SIZE
#define public_key_calculate_context_size \
    NRF_CRYPTO_BACKEND_SECP256K1_PUBLIC_KEY_CALCULATE_CONTEXT_SIZE
#elif NRF_CRYPTO_ECC_BP256R1_ENABLED
#define key_pair_generate_impl    nrf_crypto_backend_bp256r1_key_pair_generate
#define public_key_calculate_impl nrf_crypto_backend_bp256r1_public_key_calculate
#define private_key_from_raw_impl nrf_crypto_backend_bp256r1_private_key_from_raw
#define private_key_to_raw_impl   nrf_crypto_backend_bp256r1_private_key_to_raw
#define public_key_from_raw_impl  nrf_crypto_backend_bp256r1_public_key_from_raw
#define public_key_to_raw_impl    nrf_crypto_backend_bp256r1_public_key_to_raw
#define private_key_free_impl     nrf_crypto_backend_bp256r1_private_key_free
#define public_key_free_impl      nrf_crypto_backend_bp256r1_public_key_free
#define key_pair_generate_context_size \
    NRF_CRYPTO_BACKEND_BP256R1_KEY_PAIR_GENERATE_CONTEXT_SIZE
#define public_key_calculate_context_size \
    NRF_CRYPTO_BACKEND_BP256R1_PUBLIC_KEY_CALCULATE_CONTEXT_SIZE
#elif NRF_CRYPTO_ECC_BP384R1_ENABLED
#define key_pair_generate_impl    nrf_crypto_backend_bp384r1_key_pair_generate
#define public_key_calculate_impl nrf_crypto_backend_bp384r1_public_key_calculate
#define private_key_from_raw_impl nrf_crypto_backend_bp384r1_private_key_from_raw
#define private_key_to_raw_impl   nrf_crypto_backend_bp384r1_private_key_to_raw
#define public_key_from_raw_impl  nrf_crypto_backend_bp384r1_public_key_from_raw
#define public_key_to_raw_impl    nrf_crypto_backend_bp384r1_public_key_to_raw
#define private_key_free_impl     nrf_crypto_backend_bp384r1_private_key_free
#define public_key_free_impl      nrf_crypto_backend_bp384r1_public_key_free
#define key_pair_generate_context_size \
    NRF_CRYPTO_BACKEND_BP384R1_KEY_PAIR_GENERATE_CONTEXT_SIZE
#define public_key_calculate_context_size \
    NRF_CRYPTO_BACKEND_BP384R1_PUBLIC_KEY_CALCULATE_CONTEXT_SIZE
#elif NRF_CRYPTO_ECC_BP512R1_ENABLED
#define key_pair_generate_impl    nrf_crypto_backend_bp512r1_key_pair_generate
#define public_key_calculate_impl nrf_crypto_backend_bp512r1_public_key_calculate
#define private_key_from_raw_impl nrf_crypto_backend_bp512r1_private_key_from_raw
#define private_key_to_raw_impl   nrf_crypto_backend_bp512r1_private_key_to_raw
#define public_key_from_raw_impl  nrf_crypto_backend_bp512r1_public_key_from_raw
#define public_key_to_raw_impl    nrf_crypto_backend_bp512r1_public_key_to_raw
#define private_key_free_impl     nrf_crypto_backend_bp512r1_private_key_free
#define public_key_free_impl      nrf_crypto_backend_bp512r1_public_key_free
#define key_pair_generate_context_size \
    NRF_CRYPTO_BACKEND_BP512R1_KEY_PAIR_GENERATE_CONTEXT_SIZE
#define public_key_calculate_context_size \
    NRF_CRYPTO_BACKEND_BP512R1_PUBLIC_KEY_CALCULATE_CONTEXT_SIZE
#elif NRF_CRYPTO_ECC_CURVE25519_ENABLED
#define key_pair_generate_impl    nrf_crypto_backend_curve25519_key_pair_generate
#define public_key_calculate_impl nrf_crypto_backend_curve25519_public_key_calculate
#define private_key_from_raw_impl nrf_crypto_backend_curve25519_private_key_from_raw
#define private_key_to_raw_impl   nrf_crypto_backend_curve25519_private_key_to_raw
#define public_key_from_raw_impl  nrf_crypto_backend_curve25519_public_key_from_raw
#define public_key_to_raw_impl    nrf_crypto_backend_curve25519_public_key_to_raw
#define private_key_free_impl     nrf_crypto_backend_curve25519_private_key_free
#define public_key_free_impl      nrf_crypto_backend_curve25519_public_key_free
#define key_pair_generate_context_size \
    NRF_CRYPTO_BACKEND_CURVE25519_KEY_PAIR_GENERATE_CONTEXT_SIZE
#define public_key_calculate_context_size \
    NRF_CRYPTO_BACKEND_CURVE25519_PUBLIC_KEY_CALCULATE_CONTEXT_SIZE
#elif NRF_CRYPTO_ECC_ED25519_ENABLED
#define key_pair_generate_impl    nrf_crypto_backend_ed25519_key_pair_generate
#define public_key_calculate_impl nrf_crypto_backend_ed25519_public_key_calculate
#define private_key_from_raw_impl nrf_crypto_backend_ed25519_private_key_from_raw
#define private_key_to_raw_impl   nrf_crypto_backend_ed25519_private_key_to_raw
#define public_key_from_raw_impl  nrf_crypto_backend_ed25519_public_key_from_raw
#define public_key_to_raw_impl    nrf_crypto_backend_ed25519_public_key_to_raw
#define private_key_free_impl     nrf_crypto_backend_ed25519_private_key_free
#define public_key_free_impl      nrf_crypto_backend_ed25519_public_key_free
#define key_pair_generate_context_size \
    NRF_CRYPTO_BACKEND_ED25519_KEY_PAIR_GENERATE_CONTEXT_SIZE
#define public_key_calculate_context_size \
    NRF_CRYPTO_BACKEND_ED25519_PUBLIC_KEY_CALCULATE_CONTEXT_SIZE
#else
#define key_pair_generate_impl            NULL
#define public_key_calculate_impl         NULL
#define private_key_from_raw_impl         NULL
#define private_key_to_raw_impl           NULL
#define public_key_from_raw_impl          NULL
#define public_key_to_raw_impl            NULL
#define private_key_free_impl             NULL
#define public_key_free_impl              NULL
#define key_pair_generate_context_size    0
#define public_key_calculate_context_size 0
#endif


#define BACKEND_IMPL_GET(function, curve_type) (function)


#endif


ret_code_t nrf_crypto_internal_ecc_key_output_prepare(
    nrf_crypto_ecc_curve_info_t          const * p_curve_info,
    nrf_crypto_internal_ecc_key_header_t       * p_key_header)
{
    // Check NULL pointers
    VERIFY_TRUE(p_curve_info != NULL, NRF_ERROR_CRYPTO_INPUT_NULL);
    VERIFY_TRUE(p_key_header != NULL, NRF_ERROR_CRYPTO_OUTPUT_NULL);

